{
    "columnNames": [
        "Method",
        "DSC",
        "mIoU",
        "Recall",
        "Precision"
    ],
    "rows": [
        {
            "Method": "Fully Convoutional Network",
            "DSC": "-",
            "mIoU": "-",
            "Recall": "0.7732",
            "Precision": "0.8999"
        },
        {
            "Method": "CNN",
            "DSC": "(0.62-0.87)",
            "mIoU": "-",
            "Recall": "-",
            "Precision": "-"
        },
        {
            "Method": "SegNet",
            "DSC": "-",
            "mIoU": "-",
            "Recall": "0.8824",
            "Precision": "-"
        },
        {
            "Method": "Multi-scale patch-based CNN",
            "DSC": "0.8130",
            "mIoU": "-",
            "Recall": "0.7860",
            "Precision": "0.8090"
        },
        {
            "Method": "MultiResUNet with data augmentation",
            "DSC": "-",
            "mIoU": "0.8497",
            "Recall": "-",
            "Precision": "-"
        },
        {
            "Method": "Conditional generative adversarial network",
            "DSC": "0.8848",
            "mIoU": "0.8127",
            "Recall": "-",
            "Precision": "-"
        },
        {
            "Method": "U-Net",
            "DSC": "0.8781",
            "mIoU": "0.788",
            "Recall": "0.7865",
            "Precision": "0.9329"
        },
        {
            "Method": "DoubleU-Net",
            "DSC": "0.9239",
            "mIoU": "0.8611",
            "Recall": "0.8457",
            "Precision": "0.9592",
            "highlightRow": true
        }
    ],
    "credits": [
        {
            "author": "D. Jha and M. A. Riegler and D. Johansen and P. Halvorsen and H. D. Johansen",
            "booktitle": "2020 IEEE 33rd International Symposium on Computer-Based Medical Systems (CBMS)",
            "title": "DoubleU-Net: A Deep Convolutional Neural Network for Medical Image Segmentation",
            "year": "2020",
            "pages": "558-564",
            "description" : "Semantic image segmentation is the process of labeling each pixel of an image with its corresponding class. An encoder-decoder based approach, like U-Net and its variants, is a popular strategy for solving medical image segmentation tasks. To improve the performance of U-Net on various segmentation tasks, we propose a novel architecture called DoubleU-Net, which is a combination of two U-Net architectures stacked on top of each other. The first U-Net uses a pre-trained VGG-19 as the encoder, which has already learned features from ImageNet and can be transferred to another task easily. To capture more semantic information efficiently, we added another U-Net at the bottom. We also adopt Atrous Spatial Pyramid Pooling (ASPP) to capture contextual information within the network. We have evaluated DoubleU-Net using four medical segmentation datasets, covering various imaging modalities such as colonoscopy, dermoscopy, and microscopy. Experiments on the MICCAI 2015 segmentation challenge, the CVC-ClinicDB, the 2018 Data Science Bowl challenge, and the Lesion boundary segmentation datasets demonstrate that the DoubleU-Net outperforms U-Net and the baseline models. Moreover, DoubleU-Net produces more accurate segmentation masks, especially in the case of the CVC-ClinicDB and MICCAI 2015 segmentation challenge datasets, which have challenging images such as smaller and flat polyps. These results show the improvement over the existing U-Net model. The encouraging results, produced on various medical image segmentation datasets, show that DoubleU-Net can be used as a strong baseline for both medical image segmentation and cross-dataset evaluation testing to measure the generalizability of Deep Learning (DL) models.",
            "arXivLink": "https://arxiv.org/abs/2006.04868",
            "paperLink": "https://arxiv.org/pdf/2006.04868",
            "githubLink": "https://github.com/DebeshJha/2020-CBMS-DoubleU-Net"
        }
    ]
}